<template>
    <div class="method-info">
      <h1>Метод случайных лесов</h1>
      <section>
        <p>
          Метод <b>случайных лесов</b> (Random Forest) — это ансамблевый алгоритм машинного обучения, что означает, что он объединяет предсказания нескольких моделей для улучшения общей точности. Суть метода заключается в построении большого количества решающих деревьев, каждое из которых обучается на случайном подмножестве данных.
        </p>
        <p><b>Дерево решений</b> - это простая модель, которая принимает решения, разбивая данные на основе определенных условий. Например, если у вас есть данные о клиентах, дерево может сначала разделить их по возрасту, затем по доходу и так далее.
        </p>
          <p><b>Баггинг(bagging, bootstrap aggregating):</b> Из исходного набора данных случайным образом выбираются несколько подвыборок (с повторениями). Это означает, что некоторые примеры могут появляться в подвыборке несколько раз, а некоторые могут отсутствовать.
        </p>
        
        
      </section>
  <img src="@/assets/random-forest.png" alt="" srcset="">
      <section>
        <h2>Как работает случайный лес?</h2>
        <p>
         Случайный лес состоит из большого числа деревьев решений. Каждое дерево обучается на случайной подвыборке данных, что позволяет избежать переобучения. При предсказании нового значения каждый элемент в лесу делает свой прогноз, а окончательный результат определяется как большинство голосов (для задачи классификации) или среднее значение (для задачи регрессии).
        </p>
        <p>
          <strong>Преимущества случайного леса:</strong>
          <ul>
            <li>Снижает риск переобучения по сравнению с отдельным деревом решений.</li>
            <li>Может работать как с задачами классификации, так и регрессии.</li>
            <li>Обрабатывает как числовые, так и категориальные данные.</li>
          </ul>
        </p>
      </section>
  
      <section>
        <h2>Как строится одно дерево?</h2>
        <p>
          Каждое дерево в случайном лесу строится с использованием метода решения дерева, но с дополнительным случайным выбором признаков для каждого разбиения. Процесс включает следующие этапы:
        </p>
        <ul>
          <li>Выбор случайного подмножества обучающих данных.</li>
          <li>Для каждого узла дерева случайным образом выбирается подмножество признаков для разбиения. Это означает, что не все признаки используются для принятия решения на каждом узле, что делает деревья менее зависимыми друг от друга.</li>
          <li>Рекурсивное построение дерева до достижения определённого уровня глубины или минимального числа элементов в листе.</li>
        </ul>
      </section>
  
      <section>
        <h2>Алгоритм случайного леса</h2>
        <p>Основной алгоритм случайного леса выглядит следующим образом:</p>
        <ol>
          <li>Создать несколько решающих деревьев на случайных подмножествах данных с заменой.</li>
          <li>Для каждого дерева выбрать случайное подмножество признаков на каждом уровне разбиения.</li>
          <li>На этапе предсказания каждый классификатор (дерево) в случайном лесу предсказывает результат для объекта, а итоговый результат определяется путём голосования. Для задачи регрессии это будет среднее значение, для классификации — большинство голосов.</li>
        </ol>
      </section>
  
     
  
      <section>
        <h2>Преимущества случайных лесов</h2>
        <ul>
          <li>Высокая точность предсказаний, особенно при большом количестве деревьев.</li>
          <li>Устойчивость к переобучению благодаря случайности в обучении.</li>
          <li>Хорошо работает с неструктурированными данными, такими как изображения и текст.</li>
        </ul>
      </section>
  
      <section>
        <h2>Недостатки метода случайных лесов</h2>
        <ul>
          <li>Требуют значительных вычислительных ресурсов, особенно при большом количестве деревьев.</li>
          <li>Могут быть не так интерпретируемы, как отдельные деревья решений (сложнее понять и объяснить то, как модель принимает решения).</li>
        </ul>
      </section>
  
      <section>
        <h2>Применение случайных лесов</h2>
        <ul>
          <li>Классификация изображений, текста и других данных.</li>
          <li>Прогнозирование и анализ данных в бизнесе и финансах.</li>
          <li>Медицинская диагностика (например, классификация заболеваний).</li>
          <li>Прогнозирование потребительского поведения.</li>
        </ul>
      </section>
    </div>
  </template>
  
  <script>
  export default {
    name: 'RandomForestInfo',
    mounted() {
      // Перерисовка формул MathJax после монтирования
      if (window.MathJax) {
        window.MathJax.typesetPromise()
      }
    },
  }
  </script>
  
  <style scoped>
  .method-info {
    font-family: Arial, sans-serif;
    line-height: 1.6;
    margin: 20px;
    padding: 20px;
    background-color: #fffdfd;
    border-radius: 8px;
    box-shadow: 0 2px 6px rgba(0, 0, 0, 0.3);
  }
  
  h1 {
    font-size: 24px;
    color: #333;
  }
  
  h2 {
    font-size: 20px;
    text-align: center;
    color: #0057b4;
  }
  
  p,
  ul, 
  ol {
    color: #555;
  }
  
  li {
    margin-bottom: 5px;
  }

  img{
    display: block;
    width: 90%;
    margin: 0 auto;
  }
  </style>
  